stm32-rs/stm32f4xx-hal/src/spi.rs
    SPI6:
        SCK: [
            NoSck,
            PG13<Alternate<AF5>>
        ]
        MISO: [
            NoMiso,
            PG12<Alternate<AF5>>
        ]
        MOSI: [
            NoMosi,
            PG14<Alternate<AF5>>
        ]
}

#[cfg(any(feature = "stm32f446"))]
pins! {
    SPI2:
        SCK: [PA9<Alternate<AF5>>]
        MISO: []
        MOSI: [PC1<Alternate<AF7>>]

    SPI3:
        SCK: []
        MISO: []
        MOSI: [
            PB0<Alternate<AF7>>,
            PB2<Alternate<AF7>>,
            PD0<Alternate<AF6>>
        ]

    SPI4:
        SCK: [PG11<Alternate<AF6>>]
        MISO: [
            PG12<Alternate<AF6>>,
            PD0<Alternate<AF5>>
        ]
        MOSI: [PG13<Alternate<AF6>>]
}

#[cfg(any(feature = "stm32f469", feature = "stm32f479"))]
pins! {
    SPI2:
        SCK: [PA9<Alternate<AF5>>]
        MISO: []
        MOSI: [PC1<Alternate<AF5>>]
}

/// Interrupt events
pub enum Event {
    /// New data has been received
    Rxne ,
    /// Data can be sent
    Txe,
    /// An error occurred
    Error,
}

#[derive(Debug)]
pub struct Spi<SPI, PINS> {
    spi: SPI,
    pins: PINS,
}

macro_rules! hal {
    ($($SPIX:ident: ($spiX:ident, $apbXenr:ident, $spiXen:ident, $pclkX:ident),)+) => {
        $(
            impl<PINS> Spi<$SPIX, PINS> {
                pub fn $spiX(
                    spi: $SPIX,
                    pins: PINS,
                    mode: Mode,
                    freq: Hertz,
                    clocks: Clocks
                ) -> Self
                where PINS: Pins<$SPIX> {
                    // NOTE(unsafe) This executes only during initialisation
                    let rcc = unsafe { &(*RCC::ptr()) };

                    // Enable clock for SPI
                    rcc.$apbXenr.modify(|_, w| w.$spiXen().set_bit());

                    // disable SS output
                    spi.cr2.write(|w| w.ssoe().clear_bit());

                    let br = match clocks.$pclkX().0 / freq.0 {
                        0 => unreachable!(),
                        1...2 => 0b000,
                        3...5 => 0b001,
                        6...11 => 0b010,
                        12...23 => 0b011,
                        24...47 => 0b100,
                        48...95 => 0b101,
                        96...191 => 0b110,
                        _ => 0b111,
                    };

                    // mstr: master configuration
                    // lsbfirst: MSB first
                    // ssm: enable software slave management (NSS pin free for other uses)
                    // ssi: set nss high = master mode
                    // dff: 8 bit frames
                    // bidimode: 2-line unidirectional
                    // spe: enable the SPI bus
                    spi.cr1.write(|w| {
                        w.cpha()
                            .bit(mode.phase == Phase::CaptureOnSecondTransition)
                            .cpol()
                            .bit(mode.polarity == Polarity::IdleHigh)
                            .mstr()
                            .set_bit()
                            .br()
                            .bits(br)
                            .lsbfirst()
                            .clear_bit()
                            .ssm()
                            .set_bit()
                            .ssi()
                            .set_bit()
                            .rxonly()
                            .clear_bit()
                            .dff()
                            .clear_bit()
                            .bidimode()
                            .clear_bit()
                            .spe()
                            .set_bit()
                    });

                    Spi { spi, pins }
                }

                /// Enable interrupts for the given `event`:
                ///  - Received data ready to be read (RXNE)
                ///  - Transmit data register empty (TXE)
                ///  - Transfer error
                pub fn listen(&mut self, event: Event) {
                    match event {
                        Event::Rxne  => self.spi.cr2.modify(|_, w| { w.rxneie().set_bit() }),
                        Event::Txe   => self.spi.cr2.modify(|_, w| { w.txeie().set_bit() }),
                        Event::Error => self.spi.cr2.modify(|_, w| { w.errie().set_bit() }),
                    }
                }

                /// Disable interrupts for the given `event`:
                ///  - Received data ready to be read (RXNE)
                ///  - Transmit data register empty (TXE)
                ///  - Transfer error
                pub fn unlisten(&mut self, event: Event) {
                    match event {
                        Event::Rxne  => self.spi.cr2.modify(|_, w| { w.rxneie().clear_bit() }),
                        Event::Txe   => self.spi.cr2.modify(|_, w| { w.txeie().clear_bit() }),
                        Event::Error => self.spi.cr2.modify(|_, w| { w.errie().clear_bit() }),
                    }
                }

                /// Return `true` if the TXE flag is set, i.e. new data to transmit
                /// can be written to the SPI.
                pub fn is_txe(&self) -> bool {
                    self.spi.sr.read().txe().bit_is_set()
                }

                /// Return `true` if the RXNE flag is set, i.e. new data has been received
                /// and can be read from the SPI.
                pub fn is_rxne(&self) -> bool {
                    self.spi.sr.read().rxne().bit_is_set()
                }

                /// Return `true` if the MODF flag is set, i.e. the SPI has experienced a
                /// Master Mode Fault. (see chapter 28.3.10 of the STM32F4 Reference Manual)
                pub fn is_modf(&self) -> bool {
                    self.spi.sr.read().modf().bit_is_set()
                }

                pub fn free(self) -> ($SPIX, PINS) {
                    (self.spi, self.pins)
                }
            }

            impl<PINS> spi::FullDuplex<u8> for Spi<$SPIX, PINS> {
                type Error = Error;

